#Напишіть цикл, який буде вимагати від користувача ввести слово, в якому є літера "h" (враховуються як великі так і маленькі). Цикл не повинен завершитися, якщо користувач ввів слово без букви "h".

#Перевірте, що репозиторій в git є публічним або ваш вчитель доданий до цього репозиторію.
#Ви можете перевірити це в інкогніто-режимі вашого браузера.
#Просто вставте посилання на свій репозиторій та переконайтеся, що ви можете побачити код.

word = input("Введіть слово слово, в якому є літера 'h': ")

while 'h' not in word.lower():
    word = input("У слові немає 'h'. Введіть ще раз ще раз: ")

print("Ви ввели слово з літерою 'h'!")
